lYonkol/STM32/ADC/src/main.c
#include "stm32f4xx.h"
GPIO_InitTypeDef GPIO_InitStruct;
ADC_InitTypeDef ADC_InitStruct;
ADC_CommonInitTypeDef ADC_CommonInitStruct;
uint16_t  adc_Value =  0;
double adc_Voltage;
void GPIO_Config()
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA , ENABLE);
	GPIO_InitStruct.GPIO_Mode =GPIO_Mode_AN;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStruct.GPIO_OType =GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd =GPIO_PuPd_NOPULL;
	GPIO_InitStruct.GPIO_Speed =GPIO_Speed_100MHz;
	GPIO_Init(GPIOA , &GPIO_InitStruct);
}
void ADC_Config()
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1 ,ENABLE);
	ADC_CommonInitStruct.ADC_Mode = ADC_Mode_Independent;
	ADC_CommonInitStruct.ADC_Prescaler = ADC_Prescaler_Div4;
	ADC_CommonInit(&ADC_CommonInitStruct);
	ADC_InitStruct.ADC_Resolution = ADC_Resolution_12b;
	ADC_Init(ADC1,&ADC_InitStruct);
	ADC_Cmd(ADC1 , ENABLE);
}
uint16_t Read_ADC()
{
	ADC_RegularChannelConfig(ADC1 ,ADC_Channel_0, 1 ,ADC_SampleTime_56Cycles);

	ADC_SoftwareStartConv(ADC1);

	while(ADC_GetFlagStatus(ADC,ADC_FLAG_EOC)==RESET);
	return ADC_GetConversionValue(ADC1);





}
int main(void)
{
	GPIO_Config();
	ADC_Config();
  while (1)
  {
	  adc_Value = Read_ADC();
	  adc_Voltage = (0.000805) * adc_Value;
  }
}
